musicstore/app/controllers/pages_controller.rb

  def inventory
  if params[:search]
    @product= Product.search(params[:search])
---
SELECT `products`.* FROM `products` WHERE (product_id LIKE '%Guitar%' OR product_type LIKE '%Guitar%' OR brand LIKE '%Guitar%' OR price LIKE '%Guitar%' OR stock LIKE '%Guitar%')