musicstore/app/controllers/products_controller.rb

  def index
    if params[:search]
    @product= Product.search(params[:search])
---
SELECT `products`.* FROM `products` WHERE (product_id LIKE '%Fender%' OR product_type LIKE '%Fender%' OR brand LIKE '%Fender%' OR price LIKE '%Fender%' OR stock LIKE '%Fender%')